package eternal_contest.task2;

/**
       * Ваня принес рулет и хочет порезать его на N равных частей.
       * Рулет можно разрезать только поперек.
       * Следовательно Костя сделает только N-1 разрезов
       *
       * Вася задумался - можно ли сделать меньше разрезов.
       * Если нож бесконечно - длинный.
       *
       * Оказывается можно: чтобы получить 4 куска - нужно сделать всего 2 разреза.
       * В начале на 2 половинки, а потом эти две половинки - одним разрезом на 4 куска.
       *
       * Вам дано число N. Каким минимальным числом можно обойтись?
       *
       * Ввод:
       * N - количество кусков
       *
       * Вывод:
       * одно число - минимальное число разрезов.
       *
       * Пример 1:
       * 6 частей требуется
       * 3 разреза надо
       *
       * Пример 2:
       * 5 частей требуется
       * 3 разреза надо
 */
public class Task2 {
}
