public class TaskD {
      /**
       Дано целое число n. Требуется вывести все правильные скобочные последовательности длины 2 ⋅ n,
       упорядоченные лексикографически (см. https://ru.wikipedia.org/wiki/Лексикографический_порядок).

       В задаче используются только круглые скобки.

       Желательно получить решение, которое работает за время,
       пропорциональное общему количеству правильных скобочных последовательностей в ответе,
       и при этом использует объём памяти, пропорциональный n.
       */
      public static void main(String[] args) {

      }
}
