package eternal_contest.task1;

/**
      Абонентская плата составляет A рублей в месяц.
      За эту стоимость Костя получает B мегабайт трафика.
      Если Костя выйдет за лимит трафика,
      то каждый следующий мегабайт будет стоить ему С рублей.

      Костя планирует потратить D мегабайт в следующем месяце.
      Помогите сосчитать - во сколько обойдется интернет.

      Ввод:
      A - стоимость тарифа (абонентская плата)
      В - размер тарифа
      С - стоимость каждого лишнего мегабайта
      D - сколько Костя потратит мегабайт

      Вывод:
      Вывести одно число - суммарные расходы Кости на интернет

      Пример1:
      100 - стоимость тарифа
      10 - размер тарифа МБ
      12 - стоимость 1 лишнего мегабайта
      15 - сколько Костя потратит

      160

      5 лишних мегабайт - 5 х 12 = 60 - цена лишних мегабайт
      60 + 100 (стоимость тарифа) = 160

      Пример2:
      100 10 12 1
      100

      100 - так как Костя укладывается  в размер трафика
 */
public class Task1 {

}
