public class Main {
      /**
       Дана строка, состоящая из букв A-Z:
       * "AAAABBBCCXYZDDDDEEEFFFAAAAAABBBBBBBBBBBBBBBBBBBBBBBBBBBB"
       * Нужно написать функцию RLE, которая на выходе даст строку вида:
       * "A4B3C2XYZD4E3F3A6B28"
       * И сгенерирует любую ошибку, если на вход пришла невалидная строка.
       *
       * Пояснения:
       * 1. Если символ встречается 1 раз, он остается без изменений
       * 2. Если символ повторяется более 1 раза, к нему добавляется количество
       повторений
       */
      public static void main(String[] args) {

      }
}
